/*

1. Погода на Марсе

Сделай приложение, которое получает погоду на Марсе и показывает результат 10 последних сол (марсианских дней) на экране.
Записи о солах должны выглядеть как карточки с номером сола, а также минимальной и максимальной температурой.
Карточки с солами должны появляться строго по порядку.
По клику на карточку должно редиректить на страницу с подробной информацией по нажатому солу (какую информацию сола выводить - решай сам).
Также должна быть реализована обработка ошибок (ErrorResponse в документации)

Документация: https://maas2.apollorion.com/

Стек: JS, React, React Router

*/

/*

2. Каталог

Реализуй простейший каталог товаров с корзиной.
Товары должны добавляться в корзину и удаляться оттуда.
Можно указать кол-во товаров, которое ты добавляешь в корзину.
В корзине должно быть подробно показано, что ты добавил, сколько и итоговая стоимость всех товаров в корзине.
Содержимое корзины должно оставаться и после перезагрузки страницы.

Доп.задание: реализуй содержимое корзины, а также все операции по ней в Redux

Стек: JS, React, Redux

*/
